Code/CalendarParse/part2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CSSE375 Assignment: Parsing Calendar Data Part 2</title>
<!-- 2015-04-12 Sun 20:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Buffalo" />


</head>
<body>
<div id="content">
<h1 class="title">CSSE375 Assignment: Parsing Calendar Data Part 2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Step 1: Tests (33% of grade)</a>
<ul>
<li><a href="#sec-2-1">2.1. Requirement: Tests that operate on Strings</a></li>
<li><a href="#sec-2-2">2.2. Requirement: Test all filetypes and commands</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Step 2: Improving the design (33% of grade)</a>
<ul>
<li><a href="#sec-3-1">3.1. Requirement: The Combinatorial Explosion</a></li>
<li><a href="#sec-3-2">3.2. Requirement: Each command in its own class</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Step 3: Adding new features (33% of grade)</a>
<ul>
<li><a href="#sec-4-1">4.1. New Command: search</a></li>
<li><a href="#sec-4-2">4.2. New Command: next</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Submitting</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
So we're going to continue with the CalendarParse assignment, but now
we're going to actually test your designs by adding some new features.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Step 1: Tests (33% of grade)</h2>
<div class="outline-text-2" id="text-2">
<p>
I was a bit disappointed to see how few of you actually implemented
tests with your code.  Given how annoying it is to actually make sure
things are working properly by hand, perhaps you regret that decision
in retrospect.  Anyway, if you didn't write tests now you are required
to.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Requirement: Tests that operate on Strings</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In addition, most of the tests I did see just used the same sample
files I provided.  This is definitely a good first start, but as I'm
sure you noticed, it greatly complicates adding new test cases if you
have to write a whole new file.
</p>

<p>
I'm going to take a page from Feathers (your other textbook) pg 14.
Proper unit tests should not touch a file system.
</p>

<p>
Instead, figure out a way to write unit tests so that they can operate
on Strings rather than on files.  That way you can write your same
files directly in your test cases.
</p>

<p>
If you'd like to keep any existing tests that use files - that's fine.
But also add some string based tests.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Requirement: Test all filetypes and commands</h3>
<div class="outline-text-3" id="text-2-2">
<p>
You must test all the file types and commands, including those you add
in Step 3.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Step 2: Improving the design (33% of grade)</h2>
<div class="outline-text-2" id="text-3">
<p>
So designs I saw were all over the map - everything from just a couple
extract methods on the given code to complete redesigns with some very
fancy features.  It may be that your design is ready to accept new
features (if so great job!) - or it may be that you have some work to
do.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Requirement: The Combinatorial Explosion</h3>
<div class="outline-text-3" id="text-3-1">
<p>
As given, the code requires x times y functions, where x is the number
of parsers and y is the number of commands (i.e. a unique
implementation of each command for each file type).  This is super
bad - and even a design that adds new classes can still have this
problem.
</p>

<p>
This needs to be fixed for your design to be considered good enough.
</p>

<p>
One way to solve this is to have an intermediate type - something like
a Calendar Event (representing one particular event in the calendar).
Then you have type specific parsers that produce these events, and all
the commands operate on events rather than the unique file types
themselves.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Requirement: Each command in its own class</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The given system only had 2 commands - displayday and quit.  Hence,
quite reasonably some folks left that as a case statement.  But now
we're adding two new ones and we plan to add more in the future - this
goes beyond the usual Rule of 3.
</p>

<p>
Have an abstract class or interface to represent commands, which each
command in it's own class.  Try to design the system so that adding
new command requires the absolute minimum of Shotgun Surgery. 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Step 3: Adding new features (33% of grade)</h2>
<div class="outline-text-2" id="text-4">
<p>
Time to test the quality of your code with some new features.  If
you've got things designed right and easy to test - this should be
pretty straightforward.  But you might also have to make some design
changes to accommodate the new features.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> New Command: search</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
&gt; search Buffalo
Meeting with Buffalo
Another meeting with Buffalo
Eating hot wings in Buffalo NY
</pre>

<p>
Add a command that lets you enter a string, and returns all events
that contains that string in the name.
</p>
</div>
</div>


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> New Command: next</h3>
<div class="outline-text-3" id="text-4-2">
<pre class="example">
&gt; next
Tuesday Meeting
Tuesday Trivia Night
...some time later...
&gt; next
Wednesday Meeting
...some time later...
&gt; next
NO FUTURE EVENTS
</pre>

<p>
Add a command that displays the next event which is starting nearest
to now (but only in the future).  So if I have an Event 1 next Tuesday
and Event 2 next Friday, it should print Event 1.  But if I enter the
same command next Wednesday it should print Event 2.
</p>

<p>
You only need to consider the date of events - events on the same date
are considered to be happening at the same time.
</p>

<p>
The current day is considered to be "the future".  So (in the example
above) on next Tuesday it will print Event 1.
</p>

<p>
If there are no future events, your code should print "NO FUTURE
EVENTS".
</p>

<p>
If more than one event is happening on the same day in the future,
print all of them.
</p>

<p>
Testing this one might be just slightly interesting.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Submitting</h2>
<div class="outline-text-2" id="text-5">
<p>
Submit via the same SVN folder you did for CalendarParse Part 1.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Buffalo</p>
<p class="date">Created: 2015-04-12 Sun 20:50</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
